espressif/esp-idf/components/soc/esp32/include/soc/rtc_cntl_struct.h
            uint32_t dg_pad_force_noiso:     1;          /*digital pad force no ISO*/
            uint32_t dg_pad_force_iso:       1;          /*digital pad force ISO*/
            uint32_t dg_pad_force_unhold:    1;          /*digital pad force un-hold*/
            uint32_t dg_pad_force_hold:      1;          /*digital pad force hold*/
            uint32_t rom0_force_iso:         1;          /*ROM force ISO*/
            uint32_t rom0_force_noiso:       1;          /*ROM force no ISO*/
            uint32_t inter_ram0_force_iso:   1;          /*internal SRAM 0 force ISO*/
            uint32_t inter_ram0_force_noiso: 1;          /*internal SRAM 0 force no ISO*/
            uint32_t inter_ram1_force_iso:   1;          /*internal SRAM 1 force ISO*/
            uint32_t inter_ram1_force_noiso: 1;          /*internal SRAM 1 force no ISO*/
            uint32_t inter_ram2_force_iso:   1;          /*internal SRAM 2 force ISO*/
            uint32_t inter_ram2_force_noiso: 1;          /*internal SRAM 2 force no ISO*/
            uint32_t inter_ram3_force_iso:   1;          /*internal SRAM 3 force ISO*/
            uint32_t inter_ram3_force_noiso: 1;          /*internal SRAM 3 force no ISO*/
            uint32_t inter_ram4_force_iso:   1;          /*internal SRAM 4 force ISO*/
            uint32_t inter_ram4_force_noiso: 1;          /*internal SRAM 4 force no ISO*/
            uint32_t wifi_force_iso:         1;          /*wifi force ISO*/
            uint32_t wifi_force_noiso:       1;          /*wifi force no ISO*/
            uint32_t dg_wrap_force_iso:      1;          /*digital core force ISO*/
            uint32_t dg_wrap_force_noiso:    1;          /*digital core force no ISO*/
        };
        uint32_t val;
    } dig_iso;
    union {
        struct {
            uint32_t reserved0:            7;
            uint32_t pause_in_slp:     1;            /*pause WDT in sleep*/
            uint32_t appcpu_reset_en:  1;            /*enable WDT reset APP CPU*/
            uint32_t procpu_reset_en:  1;            /*enable WDT reset PRO CPU*/
            uint32_t flashboot_mod_en: 1;            /*enable WDT in flash boot*/
            uint32_t sys_reset_length: 3;            /*system reset counter length*/
            uint32_t cpu_reset_length: 3;            /*CPU reset counter length*/
            uint32_t level_int_en:     1;            /*N/A*/
            uint32_t edge_int_en:      1;            /*N/A*/
            uint32_t stg3:             3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t stg2:             3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t stg1:             3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t stg0:             3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t en:               1;            /*enable RTC WDT*/
        };
        uint32_t val;
    } wdt_config0;
    uint32_t wdt_config1;                             /**/
    uint32_t wdt_config2;                             /**/
    uint32_t wdt_config3;                             /**/
    uint32_t wdt_config4;                             /**/
    union {
        struct {
            uint32_t reserved0:   31;
            uint32_t feed: 1;
        };
        uint32_t val;
    } wdt_feed;
    uint32_t wdt_wprotect;                            /**/
    union {
        struct {
            uint32_t reserved0: 29;
            uint32_t ent_rtc:    1;                      /*ENT_RTC*/
            uint32_t dtest_rtc:  2;                      /*DTEST_RTC*/
        };
        uint32_t val;
    } test_mux;
    union {
        struct {
            uint32_t reserved0:         20;
            uint32_t appcpu_c1: 6;              /*{reg_sw_stall_appcpu_c1[5:0]   reg_sw_stall_appcpu_c0[1:0]}  == 0x86 will stall APP CPU*/
            uint32_t procpu_c1: 6;              /*{reg_sw_stall_procpu_c1[5:0]   reg_sw_stall_procpu_c0[1:0]}  == 0x86 will stall PRO CPU*/
        };
        uint32_t val;
    } sw_cpu_stall;
    uint32_t store4;                                 /*32-bit general purpose retention register*/
    uint32_t store5;                                 /*32-bit general purpose retention register*/
    uint32_t store6;                                 /*32-bit general purpose retention register*/
    uint32_t store7;                                 /*32-bit general purpose retention register*/
    uint32_t diag0;                                  /**/
    uint32_t diag1;                                  /**/
    union {
        struct {
            uint32_t adc1_hold_force:       1;
            uint32_t adc2_hold_force:       1;
            uint32_t pdac1_hold_force:      1;
            uint32_t pdac2_hold_force:      1;
            uint32_t sense1_hold_force:     1;
            uint32_t sense2_hold_force:     1;
            uint32_t sense3_hold_force:     1;
            uint32_t sense4_hold_force:     1;
            uint32_t touch_pad0_hold_force: 1;
            uint32_t touch_pad1_hold_force: 1;
            uint32_t touch_pad2_hold_force: 1;
            uint32_t touch_pad3_hold_force: 1;
            uint32_t touch_pad4_hold_force: 1;
            uint32_t touch_pad5_hold_force: 1;
            uint32_t touch_pad6_hold_force: 1;
            uint32_t touch_pad7_hold_force: 1;
            uint32_t x32p_hold_force:       1;
            uint32_t x32n_hold_force:       1;
            uint32_t reserved18:           14;
        };
        uint32_t val;
    } hold_force;
    union {
        struct {
            uint32_t ext_wakeup1_sel:       18;          /*Bitmap to select RTC pads for ext wakeup1*/
            uint32_t ext_wakeup1_status_clr: 1;          /*clear ext wakeup1 status*/
            uint32_t reserved19:            13;
        };
        uint32_t val;
    } ext_wakeup1;
    union {
        struct {
            uint32_t ext_wakeup1_status:18;              /*ext wakeup1 status*/
            uint32_t reserved18:        14;
        };
        uint32_t val;
    } ext_wakeup1_status;
    union {
        struct {
            uint32_t reserved0:                14;
            uint32_t close_flash_ena: 1;       /*enable close flash when brown out happens*/
            uint32_t pd_rf_ena:       1;       /*enable power down RF when brown out happens*/
            uint32_t rst_wait:       10;       /*brown out reset wait cycles*/
            uint32_t rst_ena:         1;       /*enable brown out reset*/
            uint32_t thres:          3;       /*brown out threshold*/
            uint32_t ena:             1;       /*enable brown out*/
            uint32_t det:         1;       /*brown out detect*/
        };
        uint32_t val;
    } brown_out;
    uint32_t reserved_39;
    uint32_t reserved_3d;
    uint32_t reserved_41;
    uint32_t reserved_45;
    uint32_t reserved_49;
    uint32_t reserved_4d;
    union {
        struct {
            uint32_t date:      28;
            uint32_t reserved28: 4;
        };
        uint32_t val;
    } date;
} rtc_cntl_dev_t;
extern rtc_cntl_dev_t RTCCNTL;
#endif  /* _SOC_RTC_CNTL_STRUCT_H_ */
